In [3]:
import pandas as pd

# Practice problem IV

In [4]:
# load the occupation dataset
path = 'https://raw.githubusercontent.com/um-perez-alvaro/Data-Science-Practice/master/Data/users.csv'
df = pd.read_csv(path, index_col='user_id')
df

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]

Display the first 10 entries of the dataset

In [ ]:
df.head(10)

What is the number of observations (rows) in the dataset?

In [5]:
len(df)

943

Print the name of all the columns

In [8]:
print(*df.columns, sep=", ")

age, gender, occupation, zip_code

What is the data type of each column?

In [11]:
print(df.dtypes.to_dict())

{'age': dtype('int64'), 'gender': dtype('O'), 'occupation': dtype('O'), 'zip_code': dtype('O')}

How many different occupations are in this dataset?

In [13]:
df['occupation'].nunique()

21

What is the most frequent occupation?

In [14]:
df['occupation'].mode()

0    student
Name: occupation, dtype: object

Use the `.describe` method to summarize the `age` column (mean value, max value, min value, etc)

In [16]:
df['age'].describe()

count    943.000000
mean      34.051962
std       12.192740
min        7.000000
25%       25.000000
50%       31.000000
75%       43.000000
max       73.000000
Name: age, dtype: float64

Use the `.describe` method to summarize all the non-numeric columns (unique values, etc)

In [20]:
df.describe(include='object')

       gender occupation zip_code
count     943        943      943
unique      2         21      795
top         M    student    55414
freq      670        196        9

What is the mean age of users?

In [19]:
print(df['age'].mean())

34.05196182396607

 What is the least frequent age?

In [21]:
# Count occurrences of each age
age_counts = df['age'].value_counts()

# Get the least frequent age
least_frequent_age = age_counts.idxmin()
least_frequent_count = age_counts.min()

print("Least frequent age:", least_frequent_age)
print("Number of occurrences:", least_frequent_count)

Least frequent age: 7
Number of occurrences: 1